{
    "posts":
        [
            {
                "Title": "Hello World!",
                "Date": "12/22/2020",
                "Tags": ["Misc"],
                "Description": "The first ever entry to my blogs",
                "Url": "./blogs/HelloWorld"
            },
            {
                "Title": "Book Club: Don't Make me Think - Chapter 1",
                "Date": "3/3/2023",
                "Tags": ["Books","Design"],
                "Description": "Let's read and talk about the Introduction and Chapter 1 of Steve Krug's classic book on design, <i>Don't Make me Think</i>.",
                "Url": "./blogs/DontMakeMeThink1"
            },
            {
                "Title": "Designing Billboards! Book Club: Don't Make me Think - Chapter 2 and 3",
                "Date": "3/15/2023",
                "Tags": ["Books","Design"],
                "Description": "This week we read Chapters 2 and 3 of Steve Krug's classic book on design, <i>Don't Make me Think</i> and discuss classic user behaviors and designing our sites like billboards to make them easier to scan.",
                "Url": "./blogs/DontMakeMeThink2"
            },
            {
                "Title": "Man vs Machine! Predicting the Academy Awards",
                "Date": "3/25/2023",
                "Tags": ["Coding","Movies"],
                "Description": "Is Machine Learning better than a human at predicting the winners of the Academy Awards? I trained a few basic machine learning models to test this out.",
                "Url": "./blogs/AcademyAwardsPrediction"
            },
            {
                "Title": "Don't Make me Click?! Book Club: Don't Make me Think - Chapter 4",
                "Date": "3/25/2023",
                "Tags": ["Books","Design"],
                "Description": "Today we take a look at Chapter 4 of Don't Make me Think, Krug's Second Law of Usability, \"it doesn't matter how many times I have to click, as long as each click is a mindless, unambiguous choice.\"",
                "Url": "./blogs/DontMakeMeThink4"
            },
            {
                "Title": "Omit needless words! Book Club: Don't Make me Think - Chapter 5",
                "Date": "3/26/2023",
                "Tags": ["Books","Design"],
                "Description": "Don't Make me Think Chapter 5 - Omit Words.",
                "Url": "./blogs/DontMakeMeThink5"
            },
            {
                "Title": "Navigating the web! Book Club: Don't Make me Think - Chapter 6",
                "Date": "4/14/2023",
                "Tags": ["Books","Design"],
                "Description": "On the internet we magically teleport from page to page. Making sure the navigation on your website is strong is the best way to handle this magical journey.",
                "Url": "./blogs/DontMakeMeThink6"
            }
        ]
}
